src/main/resources/xml/accommodationSalesComponentServicePort/searchPackage/searchPackage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.service.resmanagement.wdw.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ejb:searchPackage>
         <!--Optional:-->
         <request>
            <!--Optional:-->
            <bookingDate>?</bookingDate>
            <!--Optional:-->
            <code>?</code>
            <!--Optional:-->
            <description>?</description>
            <!--Optional:-->
            <resortArrivalDate>?</resortArrivalDate>
            <!--Zero or more repetitions:-->
            <salesChannelIDs>?</salesChannelIDs>
         </request>
         <!--Optional:-->
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </ejb:searchPackage>
   </soapenv:Body>
</soapenv:Envelope>
